-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Users\Alex\Git_Repositories\Thesis\Stata_log_files\hypothesis_tests_and_plo
> ts_of_coefficients.log
  log type:  text
 opened on:   5 Jul 2019, 18:56:07

. 
. /* run unweighted effects regressions, sippid is the cross-sectional unit */
. foreach i in rm_lfp working looking {
  2.         foreach j in 11 13 15 17 19 21 23 25 27 29 31 33 35 37 39 41 43 45 47 49 51 53
>   {
  3.                 estimates use Stata_ster/`i'_`j'_unweighted
  4.                 estimates store `i'_`j'_unweighted
  5.                 
.                 estimates use Stata_ster/`i'_`j'
  6.                 estimates store `i'_`j'_weighted
  7.         }       
  8. }

. 
. global m3_p3 "_LlBiXpos_22_1 _LlBiXpos_23_1 _LlBiXpos_24_1 _LlBiXpos_25_1 _LlBiXpos_26_1 
> _LlBiXpos_27_1 _LlBiXpos_28_1"

. global m0_p6 "_LlBiXpos_25_1 _LlBiXpos_26_1 _LlBiXpos_27_1 _LlBiXpos_28_1 _LlBiXpos_29_1 
> _LlBiXpos_30_1 _LlBiXpos_31_1"

. 
. global rnames "m2 m8 m9"

. global cnames ""

. matrix b_all = J(44,1,.) 

. foreach j in 11 13 {
  2.         foreach i in rm_lfp working looking {
  3.             /* read in the estimates */
.                 estimates restore `i'_`j'_weighted
  4.                 /* store the coefficients in a column vector that you create and name 
> b`i'_`j' */
.                 forvalues k=8(1)49 {
  5.                 /* collect all of the coefficients into the matrix b_all */
.                         matrix b`i'_`j' = _b[_LlBiXpos_`k'_1]
  6.                         if "`i'"=="rm_lfp" & "`j'"=="11" {
  7.                                 global rnames = "$rnames" + " m`k'"
  8.                         }
  9.                 }
 10.                 foreach k in m3_p3 m0_p6 {
 11.                         test "$`k'" 
 12.                         display "F-test of window `k' for occupation `j' and dependent
>  variable `i'"
 13.                         matrix F_`i'_`j'_`k'=r(F)
 14.                         matrix p_`i'_`j'_`k'=r(p)
 15.                 }
 16.             matrix b_all = b_all , b`i'_`j'
 17.                 global cnames = "$cnames" + " m_`i'_`j'"
 18.         }
 19. }
(results rm_lfp_11_weighted are active now)

 ( 1)  _LlBiXpos_22_1 = 0
 ( 2)  _LlBiXpos_23_1 = 0
 ( 3)  _LlBiXpos_24_1 = 0
 ( 4)  _LlBiXpos_25_1 = 0
 ( 5)  _LlBiXpos_26_1 = 0
 ( 6)  _LlBiXpos_27_1 = 0
 ( 7)  _LlBiXpos_28_1 = 0

       F(  7,   130) =    0.52
            Prob > F =    0.8212
F-test of window m3_p3 for occupation 11 and dependent variable rm_lfp

 ( 1)  _LlBiXpos_25_1 = 0
 ( 2)  _LlBiXpos_26_1 = 0
 ( 3)  _LlBiXpos_27_1 = 0
 ( 4)  _LlBiXpos_28_1 = 0
 ( 5)  _LlBiXpos_29_1 = 0
 ( 6)  _LlBiXpos_30_1 = 0
 ( 7)  _LlBiXpos_31_1 = 0

       F(  7,   130) =    0.70
            Prob > F =    0.6683
F-test of window m0_p6 for occupation 11 and dependent variable rm_lfp
conformability error
r(503);

end of do-file

r(503);

. matrix dir
    p_rm_lfp_11_m0_p6[1,1]
    F_rm_lfp_11_m0_p6[1,1]
    p_rm_lfp_11_m3_p3[1,1]
    F_rm_lfp_11_m3_p3[1,1]
    brm_lfp_11[1,1]
        b_all[44,1]

. do "C:\Users\Alex\AppData\Local\Temp\STD415c_000000.tmp"

. matrix b_all = J(44,1,.) 

. foreach j in 11 13 {
  2.         foreach i in rm_lfp working looking {
  3.             /* read in the estimates */
.                 estimates restore `i'_`j'_weighted
  4.                 /* store the coefficients in a column vector that you create and name 
> b`i'_`j' */
.                 forvalues k=8(1)49 {
  5.                 /* collect all of the coefficients into the matrix b_all */
.                         matrix b`i'_`j' = _b[_LlBiXpos_`k'_1] \
  6.                         if "`i'"=="rm_lfp" & "`j'"=="11" {
  7.                                 global rnames = "$rnames" + " m`k'"
  8.                         }
  9.                 }
 10.                 foreach k in m3_p3 m0_p6 {
 11.                         test "$`k'" 
 12.                         display "F-test of window `k' for occupation `j' and dependent
>  variable `i'"
 13.                         matrix F_`i'_`j'_`k'=r(F)
 14.                         matrix p_`i'_`j'_`k'=r(p)
 15.                 }
 16.             matrix b_all = b_all , b`i'_`j'
 17.                 global cnames = "$cnames" + " m_`i'_`j'"
 18.         }
 19. }
(results rm_lfp_11_weighted are active now)
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\Alex\AppData\Local\Temp\STD415c_000000.tmp"

. foreach j in 11 13 {
  2.         foreach i in rm_lfp working looking {
  3.             /* read in the estimates */
.                 estimates restore `i'_`j'_weighted
  4.                 /* store the coefficients in a column vector that you create and name 
> b`i'_`j' */
.                 forvalues k=8(1)49 {
  5.                 /* collect all of the coefficients into the matrix b_all */
.                         matrix b`i'_`j' = \ _b[_LlBiXpos_`k'_1] 
  6.                         if "`i'"=="rm_lfp" & "`j'"=="11" {
  7.                                 global rnames = "$rnames" + " m`k'"
  8.                         }
  9.                 }
 10.                 foreach k in m3_p3 m0_p6 {
 11.                         test "$`k'" 
 12.                         display "F-test of window `k' for occupation `j' and dependent
>  variable `i'"
 13.                         matrix F_`i'_`j'_`k'=r(F)
 14.                         matrix p_`i'_`j'_`k'=r(p)
 15.                 }
 16.             matrix b_all = b_all , b`i'_`j'
 17.                 global cnames = "$cnames" + " m_`i'_`j'"
 18.         }
 19. }
(results rm_lfp_11_weighted are active now)
\_b not found
r(111);

end of do-file

r(111);

. do "C:\Users\Alex\AppData\Local\Temp\STD415c_000000.tmp"

. matrix b_all = J(44,1,.) 

. foreach j in 11 13 {
  2.         foreach i in rm_lfp working looking {
  3.             /* read in the estimates */
.                 estimates restore `i'_`j'_weighted
  4.                 /* store the coefficients in a column vector that you create and name 
> b`i'_`j' */
.                 forvalues k=8(1)49 {
  5.                 /* collect all of the coefficients into the matrix b_all */
.                         matrix b`i'_`j' = b`i'_`j' \ _b[_LlBiXpos_`k'_1]
  6.                         if "`i'"=="rm_lfp" & "`j'"=="11" {
  7.                                 global rnames = "$rnames" + " m`k'"
  8.                         }
  9.                 }
 10.                 foreach k in m3_p3 m0_p6 {
 11.                         test "$`k'" 
 12.                         display "F-test of window `k' for occupation `j' and dependent
>  variable `i'"
 13.                         matrix F_`i'_`j'_`k'=r(F)
 14.                         matrix p_`i'_`j'_`k'=r(p)
 15.                 }
 16.             matrix b_all = b_all , b`i'_`j'
 17.                 global cnames = "$cnames" + " m_`i'_`j'"
 18.         }
 19. }
(results rm_lfp_11_weighted are active now)

 ( 1)  _LlBiXpos_22_1 = 0
 ( 2)  _LlBiXpos_23_1 = 0
 ( 3)  _LlBiXpos_24_1 = 0
 ( 4)  _LlBiXpos_25_1 = 0
 ( 5)  _LlBiXpos_26_1 = 0
 ( 6)  _LlBiXpos_27_1 = 0
 ( 7)  _LlBiXpos_28_1 = 0

       F(  7,   130) =    0.52
            Prob > F =    0.8212
F-test of window m3_p3 for occupation 11 and dependent variable rm_lfp

 ( 1)  _LlBiXpos_25_1 = 0
 ( 2)  _LlBiXpos_26_1 = 0
 ( 3)  _LlBiXpos_27_1 = 0
 ( 4)  _LlBiXpos_28_1 = 0
 ( 5)  _LlBiXpos_29_1 = 0
 ( 6)  _LlBiXpos_30_1 = 0
 ( 7)  _LlBiXpos_31_1 = 0

       F(  7,   130) =    0.70
            Prob > F =    0.6683
F-test of window m0_p6 for occupation 11 and dependent variable rm_lfp
conformability error
r(503);

end of do-file

r(503);

. matrix dir
    p_rm_lfp_11_m0_p6[1,1]
    F_rm_lfp_11_m0_p6[1,1]
    p_rm_lfp_11_m3_p3[1,1]
    F_rm_lfp_11_m3_p3[1,1]
    brm_lfp_11[43,1]
        b_all[44,1]

. do "C:\Users\Alex\AppData\Local\Temp\STD415c_000000.tmp"

. matrix b_all = J(43,1,.) 

. foreach j in 11 13 {
  2.         foreach i in rm_lfp working looking {
  3.             /* read in the estimates */
.                 estimates restore `i'_`j'_weighted
  4.                 /* store the coefficients in a column vector that you create and name 
> b`i'_`j' */
.                 forvalues k=8(1)49 {
  5.                 /* collect all of the coefficients into the matrix b_all */
.                         matrix b`i'_`j' = b`i'_`j' \ _b[_LlBiXpos_`k'_1]
  6.                         if "`i'"=="rm_lfp" & "`j'"=="11" {
  7.                                 global rnames = "$rnames" + " m`k'"
  8.                         }
  9.                 }
 10.                 foreach k in m3_p3 m0_p6 {
 11.                         test "$`k'" 
 12.                         display "F-test of window `k' for occupation `j' and dependent
>  variable `i'"
 13.                         matrix F_`i'_`j'_`k'=r(F)
 14.                         matrix p_`i'_`j'_`k'=r(p)
 15.                 }
 16.             matrix b_all = b_all , b`i'_`j'
 17.                 global cnames = "$cnames" + " m_`i'_`j'"
 18.         }
 19. }
(results rm_lfp_11_weighted are active now)

 ( 1)  _LlBiXpos_22_1 = 0
 ( 2)  _LlBiXpos_23_1 = 0
 ( 3)  _LlBiXpos_24_1 = 0
 ( 4)  _LlBiXpos_25_1 = 0
 ( 5)  _LlBiXpos_26_1 = 0
 ( 6)  _LlBiXpos_27_1 = 0
 ( 7)  _LlBiXpos_28_1 = 0

       F(  7,   130) =    0.52
            Prob > F =    0.8212
F-test of window m3_p3 for occupation 11 and dependent variable rm_lfp

 ( 1)  _LlBiXpos_25_1 = 0
 ( 2)  _LlBiXpos_26_1 = 0
 ( 3)  _LlBiXpos_27_1 = 0
 ( 4)  _LlBiXpos_28_1 = 0
 ( 5)  _LlBiXpos_29_1 = 0
 ( 6)  _LlBiXpos_30_1 = 0
 ( 7)  _LlBiXpos_31_1 = 0

       F(  7,   130) =    0.70
            Prob > F =    0.6683
F-test of window m0_p6 for occupation 11 and dependent variable rm_lfp
conformability error
r(503);

end of do-file

r(503);

. matrix dir
    p_rm_lfp_11_m0_p6[1,1]
    F_rm_lfp_11_m0_p6[1,1]
    p_rm_lfp_11_m3_p3[1,1]
    F_rm_lfp_11_m3_p3[1,1]
    brm_lfp_11[85,1]
        b_all[43,1]

. matrix lis brm_lfp_11

brm_lfp_11[85,1]
             c1
 r1   .39857286
 r2  -.02030402
 r3   .00424935
 r4   .10214544
 r5  -.08930753
 r6  -.12255494
 r7  -.06806734
 r8  -.05164408
 r9   .01424894
r10   .00514176
r11   .14140907
r12   .10494487
r13    .0574423
r14   .06379912
r15   .09332889
r16   .16682844
r17   .19442771
r18   .11721758
r19   .18349021
r20    .1187179
r21   .15248794
r22   .13585543
r23   .22237314
r24   .18005793
r25   .21322807
r26   .29683574
r27   .17408511
r28   .13963858
r29   .22285819
r30   .00911179
r31    .1527961
r32   .32003446
r33    .3988692
r34   .33298964
r35   .23083791
r36   .22712783
r37   .03197385
r38   .21551361
r39   .13720933
r40    .1571409
r41   .13715088
r42   .25045447
r43   .39857286
r44  -.02030402
r45   .00424935
r46   .10214544
r47  -.08930753
r48  -.12255494
r49  -.06806734
r50  -.05164408
r51   .01424894
r52   .00514176
r53   .14140907
r54   .10494487
r55    .0574423
r56   .06379912
r57   .09332889
r58   .16682844
r59   .19442771
r60   .11721758
r61   .18349021
r62    .1187179
r63   .15248794
r64   .13585543
r65   .22237314
r66   .18005793
r67   .21322807
r68   .29683574
r69   .17408511
r70   .13963858
r71   .22285819
r72   .00911179
r73    .1527961
r74   .32003446
r75    .3988692
r76   .33298964
r77   .23083791
r78   .22712783
r79   .03197385
r80   .21551361
r81   .13720933
r82    .1571409
r83   .13715088
r84   .25045447
r85   .39857286

. matrix dir
    p_rm_lfp_11_m0_p6[1,1]
    F_rm_lfp_11_m0_p6[1,1]
    p_rm_lfp_11_m3_p3[1,1]
    F_rm_lfp_11_m3_p3[1,1]
    brm_lfp_11[85,1]
        b_all[43,1]

. delete matrix brm_lfp_11
command delete is unrecognized
r(199);

. do "C:\Users\Alex\AppData\Local\Temp\STD415c_000000.tmp"

. matrix b_all = J(43,1,.) 

. foreach j in 11 13 {
  2.         foreach i in rm_lfp working looking {
  3.             /* read in the estimates */
.                 estimates restore `i'_`j'_weighted
  4.                 /* store the coefficients in a column vector that you create and name 
> b`i'_`j' */
.                 forvalues k=8(1)49 {
  5.                 /* collect all of the coefficients into the matrix b_all */
.                         matrix b`i'_`j' = b`i'_`j' \ _b[_LlBiXpos_`k'_1]
  6.                         if "`i'"=="rm_lfp" & "`j'"=="11" {
  7.                                 global rnames = "$rnames" + " m`k'"
  8.                         }
  9.                 }
 10.                 foreach k in m3_p3 m0_p6 {
 11.                         test "$`k'" 
 12.                         display "F-test of window `k' for occupation `j' and dependent
>  variable `i'"
 13.                         matrix F_`i'_`j'_`k'=r(F)
 14.                         matrix p_`i'_`j'_`k'=r(p)
 15.                 }
 16.             matrix b_all = b_all , b`i'_`j'
 17.                 global cnames = "$cnames" + " m_`i'_`j'"
 18.         }
 19. }
(results rm_lfp_11_weighted are active now)

 ( 1)  _LlBiXpos_22_1 = 0
 ( 2)  _LlBiXpos_23_1 = 0
 ( 3)  _LlBiXpos_24_1 = 0
 ( 4)  _LlBiXpos_25_1 = 0
 ( 5)  _LlBiXpos_26_1 = 0
 ( 6)  _LlBiXpos_27_1 = 0
 ( 7)  _LlBiXpos_28_1 = 0

       F(  7,   130) =    0.52
            Prob > F =    0.8212
F-test of window m3_p3 for occupation 11 and dependent variable rm_lfp

 ( 1)  _LlBiXpos_25_1 = 0
 ( 2)  _LlBiXpos_26_1 = 0
 ( 3)  _LlBiXpos_27_1 = 0
 ( 4)  _LlBiXpos_28_1 = 0
 ( 5)  _LlBiXpos_29_1 = 0
 ( 6)  _LlBiXpos_30_1 = 0
 ( 7)  _LlBiXpos_31_1 = 0

       F(  7,   130) =    0.70
            Prob > F =    0.6683
F-test of window m0_p6 for occupation 11 and dependent variable rm_lfp
conformability error
r(503);

end of do-file

r(503);

. matrix dir
    p_rm_lfp_11_m0_p6[1,1]
    F_rm_lfp_11_m0_p6[1,1]
    p_rm_lfp_11_m3_p3[1,1]
    F_rm_lfp_11_m3_p3[1,1]
    brm_lfp_11[127,1]
        b_all[43,1]

. exit, clear
